#include <stdio.h>



int n; // 饺子数
int m; // 盘子数
int l[101][101]; // 表示当饺子数为n,盘子数为m的情况下共有多少种装法

void init();

int main()
{
	int i,j;

	// 输入饺子数和盘子数
	scanf("%d %d",&n,&m);

	// 初始化二维数组
	init();

	// 考虑一般情况,当饺子数为i,盘子数为j的情况
	// 饺子数和盘子数为0或者1的情况在初始化的时候已经考虑过了，
	// 所以这里i和j都从2开始
	for(i = 2; i <= n; i++)
	{
		for(j = 2; j <= m; j++)
		{
			// 考虑有空盘子的情况
			l[i][j] = l[i][j - 1];
			
			// 考虑没有空盘子的情况
			// 当且仅当饺子数大于等于盘子数的时候才会有这种情况
			// 如果饺子数小于盘子数，则必然会有空盘子存在
			// 所以这里会加一个判断条件
			if(i >= j)
			{
				l[i][j] += l[i - j][j];
			}

		}
	}

	printf("%d\n",l[n][m]);
}


void init()
{
	int i;

	// 饺子数为0或者1时装法均为1
	for(i = 0; i <= m; i++)
	{
		l[0][i] = 1;
		l[1][i] = 1;
	}

	// 盘子数为1的时候装法也为1
	for(i = 0; i <= n; i++)
	{
		l[i][1] = 1;
	}
}
